app/views/users/index.html.erb

SELECT "users".* FROM "users"
---

<% for user in User.all %>