app/controllers/users_controller.rb

  def create
    @user = User.new(params[:user])
      if @user.save
---
INSERT INTO "users" ("username", "email", "encrypted_password", "salt", "created_at", "updated_at") VALUES ('firstuser', 'some@email.com', '$2a$10$hvmanFz0boDarOKe9OHY3Ox2Jz3FplxFArOv1jTrtuoayUTv.ccry', '$2a$10$hvmanFz0boDarOKe9OHY3O', '2012-10-23 20:45:22.279755', '2012-10-23 20:45:22.279755')